app/controllers/products_controller.rb

  def create
    @product = Product.create(product_params)
---
INSERT INTO "products" ("name", "description", "price_in_cents", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "boots"], ["description", "keep feet warm and dry"], ["price_in_cents", 30000], ["created_at", "2017-06-14 18:10:31.209850"], ["updated_at", "2017-06-14 18:10:31.209850"]]

  def update
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]