app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("product_id", "comment", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["comment", "i like"], ["rating", 3], ["created_at", "2017-06-14 20:43:23.543630"], ["updated_at", "2017-06-14 20:43:23.543630"]]
---
  def create
    @product = Product.find(params[:product_id])
    @review = @product.reviews.create(review_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  @product = Product.find(params[:product_id])
  @review = Review.find(params[:id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ? AND "reviews"."id" = ? LIMIT ?  [["product_id", 1], ["id", 2], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Stinky!"], ["rating", 1], ["updated_at", "2017-06-14 22:21:45.776748"], ["id", 3]]
---
  def update
    @product = Product.find(params[:product_id])
    @review = @product.reviews.find(params[:id])
    if @review.update(review_params)

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
  @product = Product.find(params[:product_id])
  @review = Review.find(params[:id])
  @review.destroy